artillery-verifactu.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 10
      arrivalRate: 1  # Baja tasa para minimizar memoria
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './artillery-processor.js'

scenarios:
  - name: 'VeriFactu Generate XML'
    weight: 30
    flow:
      - post:
          url: '/api/invoices/{{invoiceId}}/verifactu/generate'
          headers:
            Authorization: 'Bearer {{token}}'
          expect:
            - statusCode: 200

  - name: 'VeriFactu Send to AEAT'
    weight: 30
    flow:
      - post:
          url: '/api/invoices/{{invoiceId}}/verifactu/send'
          headers:
            Authorization: 'Bearer {{token}}'
          expect:
            - statusCode: 200

  - name: 'VeriFactu Check Status'
    weight: 40
    flow:
      - get:
          url: '/api/invoices/{{invoiceId}}/verifactu/status'
          headers:
            Authorization: 'Bearer {{token}}'
          expect:
            - statusCode: 200